Revit 2027 API
City.Longitude Property
Longitude of the city
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Longitude { get; }
Public ReadOnly Property Longitude As Double
	Get
public:
property double Longitude {
	double get ();
}
member Longitude : float with get
Property Value
Double
Remarks
A read only property that contains the longitude of the city. The value returned is in radians, ranging from -PI to +PI.
See Also
Reference
City Class
Autodesk.Revit.DB Namespace